src/cf/src/InformationRegisters/ИзбранныеЗадачи/ИзбранныеЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранныеЗадачи</name>
  <resources>
    <name>ВИзбранном</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ИзбранныеЗадачи/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗадачуВИзбранное(Задача, Исполнитель = Неопределено) Экспорт
	
	МенеджерЗаписи = МенеджерЗаписиПоЗадаче(Задача, Исполнитель);
	МенеджерЗаписи.ВИзбранном = Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьЗадачуИзИзбранного(Задача, Исполнитель = Неопределено) Экспорт
	
	МенеджерЗаписи = МенеджерЗаписиПоЗадаче(Задача, Исполнитель);
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МенеджерЗаписиПоЗадаче(Задача, Знач Исполнитель)
	
	Если Исполнитель = Неопределено Тогда
		
		Исполнитель = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Исполнитель = Исполнитель;
	
	Возврат МенеджерЗаписи;
	
КонецФункции

#КонецОбласти

#КонецЕсли
